<script setup lang="ts"></script>

<template>
  <div class="service-agreement sa">
    <div class="desc">重要须知</div>
    <div class="content">
      本协议系由北京思维魔法教育科技有限公司（以下简称“公司”）与所有使用逻辑狗会员服务的主体（包括但不限于个人、团队等）（以下简称“用户”）对逻辑狗会员服务的使用及相关服务所订立的有效合约。为使用逻辑狗会员服务（简称为：本服务），请您仔细阅读、理解并遵守《逻辑狗会员服务协议》（简称为：本协议）。本协议由您与逻辑狗会员服务协议提供方共同缔结，具有合同效力。协议中存在相关免除或限制责任的相应条款（以下称“免责条款”）、对用户权利进行限制的条款（以下称“限制条款”）、约定争议解决方式和司法管辖的条款。前述，该等免责、限制及争议解决方式和管辖条款可能以黑体加粗、颜色标记或其他合理方式提示您注意，并请您重点阅读，您对该等条款的确认将可能导致您在特定情况下的被动、不便、损失，请您在确认同意本协议之前或在使用逻辑狗会员服务协议之前再次阅读前述条款。
    </div>
    <div class="title">一、定义和说明</div>
    <div class="title">1.1【逻辑狗会员及帐号】</div>
    <div class="content">
      您如果需要使用和享受逻辑狗会员服务，则您需要将您享有合法使用权的逻辑狗帐号或第三方登录账号作为会员帐号，并在充值（含接受赠送）后享受跟充值额度相应的会员服务，您即成为逻辑狗会员。本条款下又称“您”、“用户”或“会员”。
    </div>
    <div class="title">1.2【本服务】</div>
    <div class="content">
      逻辑狗会员服务，即会员可在逻辑狗应用内专享的会员权益及特色服务，包括但不限于“思维芯·儿童游戏-探索中心、思维芯·儿童游戏-探索空间、一日评估-发展评估”功能使用，具体内容以逻辑狗页面中描述为准。您理解并同意，鉴于网络服务的特殊性，公司有权根据市场情况进行会员权益及特色会员服务的全部或部分变更、调整、取消、增加。
    </div>
    <div class="title">1.3【逻辑狗会员规则】</div>
    <div class="content">
      即逻辑狗服务提供方不时发布并修订的关于逻辑狗会员的用户守则、活动规则、使用规则、公告、提示、通知及在线FAQ等内容。
    </div>
    <div class="title">1.4【协议更新】</div>
    <div class="content">
      公司可以对本协议下服务条款进行更新（包含变更、增加、减少相应的条款内容），一旦服务条款发生更新，公司会通过系统提示、信息推送和／或您在我方平台留下的联系方式通知和提醒您注意。如果您不同意变更后的协议，可以停止对本服务的使用。您继续使用公司提供的服务，则视为您已经接受本协议的全部修改。
    </div>
    <div class="title">1.5【本协议】</div>
    <div class="content">
      1.5.1本协议视为《逻辑狗服务协议》、《特权介绍》的补充协议，是其不可分割的组成部分，与其构成统一整体。本协议与上述内容存在冲突的，以本协议为准。
    </div>
    <div class="content">
      1.5.2本协议内容同时包括公司可能不断发布的关于本服务的相关协议、业务规则等内容。上述内容一经正式发布，即为本协议不可分割的组成部分。同样对双方生效
    </div>
    <div class="title">二、帐号管理及使用规则</div>
    <div class="title">2.1【帐号管理】</div>
    <div class="content">
      2.1.1您应正确使用及妥善保管、维护您的逻辑狗帐号及密码，如发生任何泄漏、遗失、被盗等行为，而该等行为并非逻辑狗公司法定过错导致，所有损失将由您自行承担；
    </div>
    <div class="content">
      2.1.2您在此授予逻辑狗公司保护您帐号安全的相关权利，公司可定期或不定期采用不同的方式对您帐号的使用安全进行检查、验证，包括但不限于主动联系您进行身份验证、短消息验证、邮箱认证及密码修改等。如您无法完成验证或无正当理由拒绝验证的，公司可合理怀疑您的帐号出现异常或被盗，并中止向该帐号提供服务或采取进一步措施。
    </div>
    <div class="title">2.2【使用规则】</div>
    <div class="title">2.2.1【合法获取及使用】</div>
    <div class="content">
      (1)逻辑狗会员服务，均仅限于您在逻辑狗平台内使用，任何以破解、转译、转录等非法手段将逻辑狗服务与逻辑狗平台分离的行为，均不属于本条款中约定的逻辑狗会员服务。公司保留追究侵权人的法律责任及索赔的权利。
    </div>
    <div class="content">
      (2)任何以盗窃、利用系统漏洞、通过任何非公司官方或授权途径获得的逻辑狗会员服务（包括但不限于购买、租用、借用、分享、受让等方式获得）、恶意利用或破坏逻辑狗会员活动获得的会员服务，均不获相关保护，公司有权取消及/或不予提供会员服务，所有产生的损失及责任由行为人自行承担。
    </div>
    <div class="content">
      (3)使用逻辑狗会员服务及/或参加相关活动时，亦应通过逻辑狗官方公布/授权的方式进行，用户通过其他任何渠道、任何途径、任何方式非法获取的逻辑狗会员服务（包括且不限于帐号、会员权益、会员服务激活码等）或参加活动获取福利（包括但不限于获得实体/虚拟礼品、会员权益、会员服务激活码等），均不获保护，且一经发现公司有权立即就相关服务做出删除、取消、清零等处理，或采取其他如中止或终止对您提供服务等帐号管理措施，所有产生的损失及责任由行为人自行承担。
    </div>
    <div class="content">
      (4)您参加会员活动时，应按照活动规则、以合法及不损害活动举办方的方式进行，利用系统漏洞、规则设置缺陷、系统设置错误、滥用会员身份等参加活动并获取相关福利的，均不获保护，且公司有权采取相关措施进行处理，所有产生的损失及责任由行为人自行承担。
    </div>
    <div class="title">2.2.2【专有及非商业目的使用】</div>
    <div class="content">
      (1)逻辑狗会员服务，是在您遵守本条款及相关法律法规的前提下，公司给予您一项个人的、不可转让及非排他性的许可。您仅可为非商业目的使用，并仅可用作私人使用。
    </div>
    <div class="content">
      (2)您理解并同意，您不得将享有会员服务的逻辑狗账号以任何方式提供给他人使用，包括但不限于不得以转让、出租、借用、分享、出售等方式提供给他人作包括但不限于分享、上传、参加活动等使用。否则，因此产生任何法律后果及责任均由您自行承担，且公司有权中止或终止对您提供服务。
    </div>
    <div class="title">2.2.3【帐号独立】</div>
    <div class="content">
      (1)同一主体拥有多个逻辑狗帐号并进行逻辑狗会员登录的，每一个逻辑狗帐号将被识别为一个独立的帐号。
    </div>
    <div class="content">
      (2)每个逻辑狗帐号之间的充值记录、视频数据无法进行转移、迁徙、转让、赠与、售卖、租借、分享，无论该等帐号是否由同一使用人拥有，请您在登录及/或充值/参加活动时注意区分，避免造成损失。
    </div>
    <div class="title">2.2.4【帐号找回】</div>
    <div class="content">
      您登录逻辑狗时使用的账号信息遗失、忘记密码，导致无法登录逻辑狗的，您如需找回的，需按照公司官方公布的帐号找回流程的要求提供相应的信息和证明，并确保提供的信息和证明文件的合法真实有效，若提供的材料不真实或不符合要求，无法通过公司的安全验证，可能会导致帐号找回失败，相应的风险和损失将由您自行承担。您理解公司对您的请求采取行动及处理均需要合理时间，除公司存在法定过错外，公司对您的损失不承担任何责任。
    </div>
    <div class="title">2.2.5【谨慎操作】</div>
    <div class="content">
      逻辑狗向您提供数据存储、同步、管理和分享等在线服务，您完全拥有、控制存储在自己网盘空间里的数据，并自行对存储的数据进行编辑、修改、删除或清空等操作。如您自行删除并清空所存储的数据，逻辑狗将同步删除您的在线数据，按照您的指令不再保留该数据。就数据的删除、清空等操作，您应谨慎操作。
    </div>
    <div class="title">三、会员服务内容</div>
    <div class="title">3.1【会员特权】</div>
    <div class="content">
      3.1.1在您开通会员/超级会员服务后，根据您的充值记录及您参加的相关活动，将会享有对应服务体验，具体以相关服务页面公布、实际提供的内容为准。
    </div>
    <div class="content">
      3.1.2您在购买逻辑狗会员后可享受的全部权益以逻辑狗官方网站公布的会员权益为准，公司有权基于自身业务发展需要变更全部或部分会员权益。就前述权益调整逻辑狗会通过在相应服务页面更新展示、系统提示、信息推送和／或您在我方平台留下的联系方式通知和提醒您注意，您也可通过逻辑狗官方网站或移动端查询最新的会员权益内容。同时我们也鼓励您定期查看本协议内容，以更好地保障您的权益。
    </div>
    <div class="title">3.2【虚拟产品】</div>
    <div class="content">
      基于虚拟产品的性质和特征，您所获取的虚拟产品不能够进行退货、换货、兑换现金，亦不得用于商业领域，如买卖、置换、抵押等。为了保证您的用户权益，请您通过官方渠道购买逻辑狗会员产品，一切通过非官方公布渠道取得的虚拟产品及其衍生服务均不获保护，公司有权中止或终止对您的服务；由此带来的损失，逻辑狗不承担相关责任。
    </div>
    <div class="title">3.3【设备及系统差异】</div>
    <div class="content">
      您通过公司指定渠道开通本服务后，可能会由于您使用的软件版本、设备、操作系统等不同以及其他第三方原因等导致您实际可使用的具体服务有差别，由此可能给您带来的不便，您表示理解，您不予追究或者豁免公司的相关责任。
    </div>
    <div class="title">3.4【关于收费】</div>
    <div class="content">
      本服务是公司提供的收费服务，您须在按照本服务的收费标准支付相应费用后，方可使用本服务。此外，您可能也可以通过接受好友赠送等公司认可的其他方式享有、使用本服务。公司可能会根据本服务的整体规划，对本服务相关权益细则、收费标准、方式等进行修改和变更，前述修改、变更，公司将在相应服务页面进行更新展示。公司会根据实际状况，对不同阶段充值、续费的会员给予不同的优惠，具体优惠政策以公司在相关服务页面公示的信息为准。同时我们也鼓励您定期查看本协议内容，以更好地保障您的权益。您在此理解并同意因参加活动不同或会员等级不同，逻辑狗会员将享受不同的增值服务或资费。
    </div>
    <div class="title">3.5【支付】</div>
    <div class="content">
      3.5.1您应该通过公司指定的包括但不限于支付宝支付、微信支付等方式等现有方式或今后公司指定方式，依约支付。支付完成后，不可进行转让或退款。除非因逻辑狗产品技术原因，导致您购买时被重复扣款或因逻辑狗产品技术原因导致您无法享有购买的服务时，您可提出退款申诉，经过公司核实后可为您办理退款，但您需要提供相应信息并配合公司处理。
    </div>
    <div class="content">3.5.2您不得通过以下任何方式为自己或他人开通本服务：</div>
    <div class="content">(1)以营利、经营等非个人使用的目的为自己或他人开通本服务；</div>
    <div class="content">
      (2)通过任何机器人软件、蜘蛛软件、爬虫软件、刷屏软件等任何程序、软件方式为自己或他人开通本服务；
    </div>
    <div class="content">
      (3)通过任何不正当手段或以违反诚实信用原则的方式为自己或他人开通本服务；
    </div>
    <div class="content">(4)通过非公司指定的方式为自己或他人开通本服务；</div>
    <div class="content">(5)通过侵犯公司或他人合法权益的方式为自己或他人开通本服务；</div>
    <div class="content">
      (6)通过其他违反相关法律、行政法规、国家政策等的方式为自己或他人开通本服务；
    </div>
    <div class="content">
      3.5.3您理解并认可，如果您通过第三方支付工具在我方平台账户支付或充值后可能产生的任何商业风险（包括但不限于不法分子利用您账户或银行卡等有价卡等进行违法活动，第三方代为充值后再退款导致您的会员权益无法实现；采用第三方黑产渠道代为充值，或通过第三方非正规渠道购买远低于市场价值的逻辑狗会员权益等），该等风险均有可能给您造成相应的经济损失，我方在充分履行本协议项下义务和符合法律规定的前提下，在法律有明确规定的情况和范围内，承担相应的责任。
    </div>
    <div class="title">3.6【服务期限】</div>
    <div class="content">
      3.6.1除本协议另有约定外，本服务的期限以您自行选择并支付相应服务费用的期限为准，自您选择并购买本服务后生效，直至服务到期或您终止本服务/注销会员资格时终止，您也可以登录逻辑狗会员中心或者本服务的相应页面查询。
    </div>
    <div class="content">
      3.6.2请您理解，由于互联网服务的特殊性，为向您提供优质服务，逻辑狗须不定时进行服务器的维修、调整、升级等，且在黑客攻击、计算机病毒侵入、监管机构政策通知等不可抗力事件发生后，逻辑狗须解决故障并处理相关侵权事宜，因此您接受，本服务的服务期限包含逻辑狗解决故障、服务器维修、调整、升级、因第三方侵权处理等所需的合理时间，公司对上述情况所需用的时间不另行补偿。
    </div>
    <div class="title">3.7【价格说明】 划线价格：是指商品历史销售价格。</div>
    <div class="content">
      未划线价格：是指商品销售标价，具体的成交价格可能因使用优惠券等发生变化，最终以订单支付金额为准。
    </div>
    <div class="content">折扣：如无特殊说明，折扣指在划线价格基础上计算出的优惠比例。</div>
    <div class="content">
      折上立减：如无特殊说明，折上立减金额指因开通自动续费而享受到的额外优惠，具体表现为划线价格与未划线价格的差值。
    </div>
    <div class="content">月均价：平均单月价格，计算方式为商品的销售标价除以对应月份。</div>
    <div class="title">四、违约责任</div>
    <div class="title">4.1您在使用本服务的过程中，不得进行以下违约行为：</div>
    <div class="content">4.1.1违反本条款约定的；</div>
    <div class="content">4.1.2违反法律、法规、规章、条例以及任何具有法律效力之规范规定的；</div>
    <div class="content">4.1.3破坏、影响公司对任何第三方提供本服务；</div>
    <div class="content">4.1.4进行危害计算机网络安全的行为；</div>
    <div class="content">
      4.1.5对公司及关联第三方（包括授权方和合作方）提供的本条款服务、活动造成不良影响，侵犯及/或关联第三方公司及/或其他用户的正当利益；
    </div>
    <div class="content">4.1.6被有权机构认定侵犯任何第三方的合法权益的；</div>
    <div class="content">
      4.1.7利用本服务获取非法利益的，包括但不限于通过转售、转让、转授权等行为不正当牟利；
    </div>
    <div class="content">4.1.8其他侵犯公司合法利益的行为；</div>
    <div class="title">4.2【违约行为处理】</div>
    <div class="content">
      您确认并同意，如果公司发现或收到他人举报您有违反本协议任何行为的，公司有权依法进行独立判断并采取以下一项或多项措施处理：
    </div>
    <div class="content">(1)根据相应规则立即删除、屏蔽或断开相关的信息；</div>
    <div class="content">(2)采取包括但不限于中止或终止部分或全部本服务的措施；</div>
    <div class="content">(3)采取扣除违约行为发生时间内的会员权益时长的措施；</div>
    <div class="content">(4)采取限制用户上传、下载、播放、分享、存储等权益的措施；</div>
    <div class="content">
      (5)公司无需向您退还任何费用，未使用的服务费用作为违约金归公司所有，您的相关会员权益的损失由您自行承担，公司在法律有明确规定的情况下承担相应的责任；
    </div>
    <div class="title">4.3【赔偿责任】</div>
    <div class="content">
      如您的行为使公司及/或其关联公司遭受损失（包括自身的直接经济损失、商誉损失及对外支付的赔偿金、和解款、律师费、诉讼费等间接经济损失），您应赔偿公司及/或其关联公司的上述全部损失。如您的行为使公司及/或其关联公司遭受第三人主张权利，公司及/或其关联公司可在对第三人承担金钱给付等义务后就全部损失向您追偿。
    </div>
    <div class="title">五、服务的变更、中止及终止</div>
    <div class="content">5.1本服务的中止或终止包含如下情况：</div>
    <div class="content">5.1.1用户主动中止或终止，包括但不限于会员到期未进行续费等；</div>
    <div class="content">5.1.2因为用户违约行为，公司主动中止或终止服务的；</div>
    <div class="content">5.1.3因国家或相关部门要求或发生不可抗力事件时，公司中止或终止服务的；</div>
    <div class="content">5.1.4其他根据法律法规或公司业务调整等应当或者需要中止或终止服务的；</div>
    <div class="content">
      5.2中止或终止服务后，逻辑狗将尽最大努力通过合理方式通知用户。当您发现无法登录或享受服务时，可以咨询我们的在线客服。
    </div>
    <div class="content">5.3中止或终止后的处理:</div>
    <div class="content">
      5.3.1除法律规定的责任外，公司对本服务的中止或终止对用户和任何第三人不承担任何责任；
    </div>
    <div class="content">5.3.2除法律规定或本协议另有约定外，已收取的费用不予退还；</div>
    <div class="content">
      5.3.3正在进行的平台交易，公司将根据情况合理判断，是否继续进行或终止相关交易，并视情况决定是否进行退费或扣除相关费用作为违约金；
    </div>
    <div class="content">
      5.4逻辑狗依据本协议的约定变更服务内容、服务方式以及本协议内容的，如果会员不同意逻辑狗的变更，有权选择取消并停止使用已经获取的对应的全部或部分服务；如果会员继续使用逻辑狗提供的上述服务，则视为会员已经接受逻辑狗的上述调整。
    </div>
    <div class="content">
      5.5会员如果不同意条款的修改，可主动向逻辑狗提出终止会员服务，但逻辑狗不退还自开通会员服务至提出终止会员服务所在月的已享受会员服务的部分费用；如果会员继续享用会员服务，则视为会员已经接受条款的修改。
    </div>
    <div class="content">
      5.6您同意，由于互联网服务的特殊性，公司有权基于合法理由，修改、变更、中断或终止部分或全部服务（统称“变更行为”）。在某些紧急情况下，逻辑狗无法事先向您发出通知，故公司保留采取前述变更行为而不需通知您的权利，公司承诺会在紧急情况解除后发布相关情况的说明。并且您同意，由于变更行为而造成的任何损失，公司无需对您对或任何第三人承担任何责任。
    </div>
    <div class="title">六、免责声明</div>
    <div class="content">
      6.1您知悉并同意，用户在逻辑狗平台上上传、发布或传输的内容，为用户的个人行为，公司不对该等信息和内容的准确性、真实性、可用性、安全性、完整性和正当性承担责任，您在此同意豁免追加公司的相关责任。
    </div>
    <div class="content">
      6.2您在进行相关信息及内容的使用、分享、下载等行为（“使用行为”）时，应进行独立判断并合法使用，因您的使用行为造成任何自身损害及对第三方的损害，公司不承担任何责任。
    </div>
    <div class="content">
      6.3因电信和网通部门的通讯线路故障、网络或电脑故障、系统不稳定、不可抗力（如服务器当机）等非公司原因造成您帐号、帐号内财产等丢失、减少的，您无权要求公司承担补偿等责任。
    </div>
    <div class="content">
      6.4您在使用逻辑狗所提供的服务时，如遭受任何人身或财务的损失、损害或伤害，除法律有明确规定外，公司不承担任何责任。由于您将个人密码告知他人或与他人共享注册帐户，由此导致的任何个人资料泄露，公司不承担任何责任。
    </div>
    <div class="content">
      6.5用户理解并同意，如用户在百度运营的其他产品中存在违规行为导致用户账号被封禁，则用户无法继续使用（包括但不限于浏览、存储、同步、管理、分享和下载等）逻辑狗服务，同时逻辑狗有权不予退还用户剩余会员权益等增值服务对应的费用。
    </div>
    <div class="content">
      6.6用户理解并同意，如用户在停用逻辑狗账号绑定的手机账号前，未对账号进行重新绑定新的手机号，导致逻辑狗在自动续费周期到期前未收到网盘扣费短信通知的，对此产生的不利后果，由用户自行承担。
    </div>
    <div class="title">七、通知</div>
    <div class="content">
      本协议项下公司对于用户所有的通知均可通过网页公告、手机短信或常规的信件传送等方式进行，该等通知于发送之日视为已送达用户。为便于您收取相关通知，您应确保预留的联系方式为正确及有效，并在变更后及时登录逻辑狗修改，如因您未提供正确的联系信息或未及时告知新的联系方式，导致无法及时收取通知，将由您自行承担由此产生的损失及法律后果。公司可通过上述方式之一或其中若干向您送达各类通知，而此类通知的内容或将对您产生重大有利或不利影响，请您务必确保联系方式为有效并请及时关注。
    </div>
    <div class="title">八、法律的适用和管辖</div>
    <div class="content">8.1本协议的订立、执行和解释及争议的解决均应适用中华人民共和国法律。</div>
    <div class="content">
      8.2如双方就本协议内容或其执行发生任何争议，双方应尽量友好协商解决；协商不成时，任何一方均可向公司所在地有管辖权的人民法院提起诉讼。
    </div>
    <div class="content">
      8.3公司未行使或执行本服务协议任何权利或规定，不构成对前述权利或权利之放弃。
    </div>
    <div class="content">
      8.4如本协议中的任何条款无论因何种原因完全或部分无效或不具有执行力，本协议的其余条款仍应有效并且有约束力。
    </div>
    <div class="content">8.5在法律法规允许的范围内，公司有权对本协议进行解释。</div>
  </div>
</template>

<style scoped lang="scss">
.content,
.title,
.desc {
  margin: 0 auto 13px;
  width: 343px;
  color: #333333;
  font-size: 12px;
  font-weight: 400;
  font-family:
    PingFang SC-Regular,
    PingFang SC;
}

.title,
.desc {
  font-weight: 600;
}
</style>
